app/controllers/disease_controller.rb

  def index
    @search = Disease.search do
---
SELECT "diseases".* FROM "diseases"